#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазделУчета				= Параметры.РазделУчета;
	Контрагент				= Параметры.Контрагент;
	Приход					= Параметры.Приход;
	Расход					= Параметры.Расход;
	Период.ДатаНачала		= Параметры.ДатаНачала;
	Период.ДатаОкончания	= Параметры.ДатаОкончания;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОтборыИсторияПлатежей = Новый Структура;
	ОтборыИсторияПлатежей.Вставить("РазделУчета"	, РазделУчета);
	ОтборыИсторияПлатежей.Вставить("Контрагент"		, Контрагент);
	ОтборыИсторияПлатежей.Вставить("ДатаНачала"		, Период.ДатаНачала);
	ОтборыИсторияПлатежей.Вставить("ДатаОкончания"	, Период.ДатаОкончания);
	ОтборыИсторияПлатежей.Вставить("Приход"			, Приход);
	ОтборыИсторияПлатежей.Вставить("Расход"			, Расход);
	
	Закрыть(ОтборыИсторияПлатежей);
	
КонецПроцедуры // ОК()

#КонецОбласти