#Область СлужебныйПрограммныйИнтерфейс

// Конвертирует табличнй документ в CSV.
//
Функция СконвертироватьВCSV(ТабДокумент, Разделитель) Экспорт
	
	СтрокаCSV = "";
	Для R = 1 По ТабДокумент.ВысотаТаблицы Цикл
		Для C = 1 По ТабДокумент.ШиринаТаблицы Цикл
			Область = ТабДокумент.Область("R" + R + "C" + C);
			СтрокаCSV = СтрокаCSV + СтрЗаменить(Область.Текст, Разделитель, ".") + Разделитель;
		КонецЦикла;
		СтрокаCSV = СтрокаCSV + Символы.ПС;
	КонецЦикла;
	
	Возврат СтрокаCSV;
	
КонецФункции

// Отправляет письмо.
//
Процедура ПослатьПисьмо(
	Получатель = "",
	Тема = "",
	ТекстСообщения = "",
	АдресВложения = Неопределено,
	НаименованиеВложения = Неопределено) Экспорт
	
	#Если МобильноеПриложениеКлиент Тогда
		Если СредстваПочты.ПоддерживаетсяОтправка() Тогда
			Письмо = Новый ИнтернетПочтовоеСообщение;
			Письмо.Получатели.Добавить(Получатель);
			Письмо.Тема = Тема;
			Письмо.Тексты.Добавить(ТекстСообщения);
			Если АдресВложения <> Неопределено Тогда
				Письмо.Вложения.Добавить(АдресВложения, НаименованиеВложения);
			КонецЕсли;
			СредстваПочты.Послать(Письмо);
		Иначе
			Предупреждение("На этом устройстве отправка почты не поддерживается.");
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

// Отправляет любое вложение.
//
Процедура ОтправитьВложениеАндроид(
	Получатель = "",
	Тема = "",
	ТекстСообщения = "",
	АдресВложения = Неопределено) Экспорт
	
	#Если МобильноеПриложениеКлиент Тогда
		Запуск = Новый ЗапускПриложенияМобильногоУстройства();
		Запуск.Действие = "android.intent.action.SEND";
		Запуск.ДополнительныеДанные.Добавить("android.intent.extra.STREAM", "file://" + АдресВложения, "Uri");
		Запуск.ДополнительныеДанные.Добавить("android.intent.extra.SUBJECT", Тема);
		Запуск.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", ТекстСообщения);
		Запуск.Данные = Получатель;
		Запуск.Тип = "text/html";
		Запуск.Запустить(Ложь);
	#КонецЕсли
	
КонецПроцедуры

// Отправляет отчет в CSV.
//
Процедура ОтправитьОтчетВCSV(ТемаПисьма, ТабДокумент) Экспорт
	
	СоздатьКаталог(КаталогДокументов() + "TempSBM");
	АдресФайла = КаталогДокументов() + "TempSBM/" + "report.csv";
	
	ТекстОтчетаCSV = ОбщегоНазначенияКлиент.СконвертироватьВCSV(ТабДокумент, ПолучитьРазделительCSV());
	ЗаписьТекста = Новый ЗаписьТекста(АдресФайла, "UTF8");
	ЗаписьТекста.Записать(ТекстОтчетаCSV);
	ЗаписьТекста.Закрыть();
	
	#Если МобильноеПриложениеКлиент Тогда
		ТекстПисьма = "Во вложении - "
		+ ТемаПисьма
		+ Символы.ПС
		+ Символы.ПС 
		+ НСтр("ru='---
		|Сформировано в мобильном приложении';en='---
		|Created in a mobile application'");
		Если ОбщегоНазначенияВызовСервера.ВерсияОС() = "iOS" Тогда
			ПослатьПисьмо(, ТемаПисьма, ТекстПисьма, АдресФайла, ТемаПисьма);
		Иначе
			ОтправитьВложениеАндроид(, ТемаПисьма, ТекстПисьма, АдресФайла);
		КонецЕсли;
	#Иначе
		ЗапуститьПриложение(АдресФайла);
	#КонецЕсли
	
КонецПроцедуры // ОтправитьОтчетВCSV()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получет тип разделителя CSV/
//
Функция ПолучитьРазделительCSV()
	
	Разделитель = НСтр("ru=';';en=','");
	
	Если ОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("ВариантРазделителяCSV") = ПредопределенноеЗначение("Перечисление.ВариантыРазделителейCSV.Запятая") Тогда
		Разделитель = ",";
	ИначеЕсли ОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("ВариантРазделителяCSV") = ПредопределенноеЗначение("Перечисление.ВариантыРазделителейCSV.ТочкаСЗапятой") Тогда
		Разделитель = ";";
	КонецЕсли;
	
	Возврат Разделитель;
	
КонецФункции

#КонецОбласти