
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазделУчета			 = Параметры.РазделУчета;
	Организация			 = Параметры.Организация;
	БанковскийСчет		 = Параметры.БанковскийСчет;
	Контрагент			 = Параметры.Контрагент;
	СуммаОт				 = Параметры.СуммаОт;
	СуммаДо				 = Параметры.СуммаДо;
	Период.ДатаНачала	 = Параметры.ДатаНачала;
	Период.ДатаОкончания = Параметры.ДатаОкончания;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОтборыИсторияПлатежей = Новый Структура;
	ОтборыИсторияПлатежей.Вставить("РазделУчета"	, РазделУчета);
	ОтборыИсторияПлатежей.Вставить("Организация"	, Организация);
	ОтборыИсторияПлатежей.Вставить("БанковскийСчет"	, БанковскийСчет);
	ОтборыИсторияПлатежей.Вставить("Контрагент"		, Контрагент);
	ОтборыИсторияПлатежей.Вставить("ДатаНачала"		, Период.ДатаНачала);
	ОтборыИсторияПлатежей.Вставить("ДатаОкончания"	, Период.ДатаОкончания);
	ОтборыИсторияПлатежей.Вставить("СуммаОт"		, СуммаОт);
	ОтборыИсторияПлатежей.Вставить("СуммаДо"		, СуммаДо);
	
	Закрыть(ОтборыИсторияПлатежей);
	
КонецПроцедуры // ОК()

#КонецОбласти

