#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьКонстанты();
	
	УстановитьДоступностьЗадатьКодДоступа();
	УстановитьСостояниеАвторизации();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("ИзменилисьНастройки");
	
КонецПроцедуры // ПриЗакрытии()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПрошелОбмен" Тогда
		УстановитьСостояниеАвторизации();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КодДоступаПереключательПриИзменении(Элемент)
	
	Если КодДоступаВключен Тогда
		Результат = ОткрытьФормуМодально("ОбщаяФорма.УстановкаКодаДоступаВПриложение");
		Если Результат = Неопределено Тогда
			КодДоступаВключен = НЕ КодДоступаВключен;
		ИначеЕсли Результат <> Неопределено И НЕ Результат Тогда
			КодДоступаВключен = Ложь;
		КонецЕсли;
	Иначе
		Результат = ОткрытьФормуМодально("ОбщаяФорма.ВводКодаДоступаВПриложение");
		Если Результат = Неопределено Тогда
			КодДоступаВключен = НЕ КодДоступаВключен;
		ИначеЕсли Результат <> Неопределено И Результат Тогда
			КодДоступаВключен = Ложь;
			ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("КодДоступаВПриложение", "");
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступностьЗадатьКодДоступа();
	
КонецПроцедуры // КодДоступаПереключательПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗадатьКодДоступа(Команда)
	
	ОткрытьФормуМодально("ОбщаяФорма.УстановкаКодаДоступаВПриложение");
	
КонецПроцедуры // ЗадатьКодДоступа()

&НаКлиенте
Процедура НастройкиСинхронизации(Команда)
	
	ОткрытьФорму("ОбщаяФорма.НастройкиСинхронизации");
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьКонстанты()
	
	Набор = Константы.СоздатьНабор();
	Набор.Прочитать();
	ЗначениеВРеквизитФормы(Набор, "НаборКонстант");
	
	КодДоступаВключен = ЗначениеЗаполнено(Константы.КодДоступаВПриложение.Получить());
	
КонецПроцедуры // ПрочитатьКонстанты()

&НаСервере
Процедура УстановитьДоступностьЗадатьКодДоступа()
	
	Элементы.ГруппаНастройкаКодДоступа.Видимость = КодДоступаВключен;
	
КонецПроцедуры // УстановитьДоступностьЗадатьКодДоступа()

&НаСервере
Процедура УстановитьСостояниеАвторизации()
	
	ИмяПользователя = ОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("ПользовательЦентральнойБазы");
	СоединениеСЦБУстановлено = Константы.СоединениеСЦБУстановлено.Получить();
	Если СоединениеСЦБУстановлено Тогда
		Элементы.ПодключитьсяОтключиться.Заголовок = НСтр("ru='Настройки подключения';en='Synchronization Settings'");
	Иначе
		ИмяПользователя = НСтр("ru='Не подключен';en='Not sync'");
		Элементы.ПодключитьсяОтключиться.Заголовок = НСтр("ru='Подключиться к сервису';en='Synchronize'");
	КонецЕсли;
	
КонецПроцедуры // УстановитьСостояниеАвторизации()

&НаКлиенте
Процедура НаборКонстантВариантРазделителяCSVПриИзменении(Элемент)
	
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("ВариантРазделителяCSV", НаборКонстант.ВариантРазделителяCSV);
	
КонецПроцедуры

#КонецОбласти