#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация			= Параметры.Организация;
	БанковскийСчет		= Параметры.БанковскийСчет;
	Контрагент			= Параметры.Контрагент;
	ДатаПлатежа			= Формат(Параметры.ДатаПлатежа, "ДФ='дд ММММ гггг, ддд'");
	НомерПлатежа		= Параметры.НомерПлатежа;
	НазначениеПлатежа	= Параметры.НазначениеПлатежа;
	Сумма				= Параметры.Сумма;
	Приход				= Параметры.Приход;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти